[
    {
        "error_codes": [
            {
                "__comment": "undefined errors",
                "keywords": [
                    "4201",
                    "4202",
                    "4203",
                    "4204",
                    "4205",
                    "4207",
                    "4208",
                    "4209",
                    "4210",
                    "4211",
                    "4212",
                    "4213",
                    "4301",
                    "4302",
                    "4303",
                    "4304",
                    "4305",
                    "4306",
                    "4307",
                    "4308"
                ],
                "action": "There are no fix yet for this error code. Check out <https://doc.yuuki.me/docs/troubleshooting/pc/error-codes#client-errors> for more info"
            },
            {
                "__comment": "Client Issue",
                "keywords": [
                    "31-4302"
                ],
                "action": "Safest way to fix this issue is to completely reinstall the game (which takes some time). Otherwise, you can try check the following sollution: https://canary.discord.com/channels/964119462188040202/1073598900100943992/1073598900100943992"
            },
            {
                "keywords": [
                    "4206"
                ],
                "action": "If you have the 4206 error, either your encryption settings are incorrect (please disable encryption in Cultivation settings) or your device has not reached the server. Please make sure that Cultivation's proxy is turned on in the settings panel and that encryption is disabled.",
                "action_cn": "你的设备并没有正常连接到服务器，检查你的代理设置(Fiddler, mitm, 等)然后重试。"
            },
            {
                "keywords": [
                    "4214"
                ],
                "action": "On Private Server, this error occured when:\n\n1. You haven't patched your game.\n2. You already patched your game, but proxy isn't running\n\nTry:\n- Check if your game is patched and the proxy is running properly\n\non Official Server, this error occured when:\n\n1. You are running the game with patch\n2. You didn't patched your game, but your proxy is running\n\nTry:\n- Check if your Proxy is running\n- Make sure your game is not patched"
            },
            {
                "keywords": [
                    "500"
                ],
                "action": "This error caused by server side when the server set the `EXPERIMENTAL_RealPassword = true` and you are running a client without a metadata patch (which no longer works in 3.1>)"
            },
            {
                "keywords": [
                    "502"
                ],
                "action": "There are two causes for this error:\n1. You have \"**Use HTTPS**\" checked in your local server\n2. Your device cannot reach the server.\nPlease uncheck \"**Use HTTPS**\" or make sure your device can reach the server.\nIf you are playing in YuukiPS, check the [Status](<https://stats.uptimerobot.com/L8Nx6FL4V>) page. Or check real-time status in <#1051149545779777586>."
            },
            {
                "__comment": "Mitmproxy issue",
                "keywords": [
                    "10048"
                ],
                "action": "Port is either being used by another instance of mitm, or other application that is running and using this port. To fix it, simply check the app that is using the port and close it. Or you can start mitm with other port by using the `-p PORTNUMBER` command-line when launching it."
            }
        ]
    }
]
